Revit 2027 API
ConnectionValidationInfo.GetWarning Method
 Access specific warning number of warnings generated by reload.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectionValidationWarning GetWarning(
	int index
)
Public Function GetWarning (
	index As Integer
) As ConnectionValidationWarning
public:
ConnectionValidationWarning^ GetWarning(
	int index
)
member GetWarning :
        index : int -> ConnectionValidationWarning
Parameters
index Int32
Return Value
ConnectionValidationWarning
Exceptions
Exception | Condition
ArgumentException |  Invalid index.
See Also
Reference
ConnectionValidationInfo Class
Autodesk.Revit.DB Namespace